### 날짜 형태 인덱스 만들기

In [4]:
import pandas as pd
import numpy as np

In [2]:
index = pd.date_range('1/1/2000', periods=8)
print(index)

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [5]:
# 8행 3열로 구성된 랜덤 데이터 생성
df = pd.DataFrame(np.random.rand(8,3), index=index, columns=list('ABC'))
df

                   A         B         C
2000-01-01  0.231332  0.335588  0.567919
2000-01-02  0.201709  0.719200  0.798835
2000-01-03  0.777624  0.612490  0.613980
2000-01-04  0.748406  0.387509  0.141696
2000-01-05  0.532510  0.712166  0.788312
2000-01-06  0.157570  0.653054  0.001115
2000-01-07  0.261851  0.652832  0.948507
2000-01-08  0.313066  0.247790  0.648090

In [7]:
print(df['B'])

2000-01-01    0.335588
2000-01-02    0.719200
2000-01-03    0.612490
2000-01-04    0.387509
2000-01-05    0.712166
2000-01-06    0.653054
2000-01-07    0.652832
2000-01-08    0.247790
Freq: D, Name: B, dtype: float64

In [8]:
print(df['B'] > 0.4)

2000-01-01    False
2000-01-02     True
2000-01-03     True
2000-01-04    False
2000-01-05     True
2000-01-06     True
2000-01-07     True
2000-01-08    False
Freq: D, Name: B, dtype: bool

In [9]:
df2 = df[df['B'] > 0.4]
df2

                   A         B         C
2000-01-02  0.201709  0.719200  0.798835
2000-01-03  0.777624  0.612490  0.613980
2000-01-05  0.532510  0.712166  0.788312
2000-01-06  0.157570  0.653054  0.001115
2000-01-07  0.261851  0.652832  0.948507

In [10]:
df2.T

   2000-01-02  2000-01-03  2000-01-05  2000-01-06  2000-01-07
A    0.201709    0.777624    0.532510    0.157570    0.261851
B    0.719200    0.612490    0.712166    0.653054    0.652832
C    0.798835    0.613980    0.788312    0.001115    0.948507

### 행 방향 축을 기준으로 한 연산

- A열 값을 B열 값으로 나눈 후, 그 결과를 D열에 저장

In [11]:
df['D'] = df['A']/df['B']
df

                   A         B         C         D
2000-01-01  0.231332  0.335588  0.567919  0.689332
2000-01-02  0.201709  0.719200  0.798835  0.280462
2000-01-03  0.777624  0.612490  0.613980  1.269612
2000-01-04  0.748406  0.387509  0.141696  1.931323
2000-01-05  0.532510  0.712166  0.788312  0.747733
2000-01-06  0.157570  0.653054  0.001115  0.241281
2000-01-07  0.261851  0.652832  0.948507  0.401100
2000-01-08  0.313066  0.247790  0.648090  1.263430

### 행 방향 축을 기준으로 한 연산

- 행 우선 합을 E열에 저장

In [12]:
df['E'] = np.sum(df, axis=1)
df.head()

                   A         B         C         D         E
2000-01-01  0.231332  0.335588  0.567919  0.689332  1.824170
2000-01-02  0.201709  0.719200  0.798835  0.280462  2.000206
2000-01-03  0.777624  0.612490  0.613980  1.269612  3.273705
2000-01-04  0.748406  0.387509  0.141696  1.931323  3.208935
2000-01-05  0.532510  0.712166  0.788312  0.747733  2.780721

### 전체 데이터 연산

In [14]:
# A열의 데이터를 기준으로, A열의 값으로 뺌
df = df.sub(df['A'],axis=0)
df.head()

              A         B         C         D         E
2000-01-01  0.0  0.104256  0.336587  0.458001  1.592839
2000-01-02  0.0  0.517491  0.597127  0.078754  1.798498
2000-01-03  0.0 -0.165134 -0.163644  0.491988  2.496081
2000-01-04  0.0 -0.360897 -0.606709  1.182918  2.460529
2000-01-05  0.0  0.179656  0.255803  0.215223  2.248211

In [15]:
df = df.div(df['C'],axis=0)
df.head()

              A         B    C         D          E
2000-01-01  0.0  0.309745  1.0  1.360719   4.732321
2000-01-02  0.0  0.866635  1.0  0.131888   3.011919
2000-01-03 -0.0  1.009107  1.0 -3.006449 -15.253102
2000-01-04 -0.0  0.594843  1.0 -1.949727  -4.055532
2000-01-05  0.0  0.702322  1.0  0.841365   8.788853

In [16]:
df.to_csv('text_csv')